# tap "buo/cask-upgrade"
# tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Search tool like grep, but optimized for programmers
brew "ack"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# CircleCI CLI
brew "circleci"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Add GitHub support to git on the command-line
brew "hub"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Not sure tbh
brew "kubernetes-cli"
# Postgres C API library
brew "libpq"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql-client@5.7"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Interpreted, interactive, object-oriented programming language
brew "python"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"

# NFI what this does, something DevOps related
tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# Validate your Kubernetes configurations
tap "instrumenta/instrumenta"
brew "instrumenta/instrumenta/kubeval"

# Tail logs from multiple Kubernetes pods at the same time
tap "johanhaleby/kubetail"
brew "johanhaleby/kubetail/kubetail"

# Decode all parts of a kubernetes secret, no more copypasting!
tap "mveritym/mel"
brew "mveritym/mel/kubedecode"

# The official CLI for Amazon EKS
tap "weaveworks/tap"
brew "weaveworks/tap/eksctl"

cask "docker"
cask "brave-browser"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "iterm2"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "steelseries-exactmouse-tool"

mas "1Password 7", id: 1333542190
# mas "Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Affinity Publisher", id: 881418622
# mas "Amphetamine", id: 937984704
# mas "Compressor", id: 424390742
# mas "Disk Speed Test", id: 425264550
mas "Divvy", id: 413857545
# mas "Final Cut Pro", id: 424389933
mas "GoodTask", id: 1143437985
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
# mas "Messenger", id: 1480068668
mas "Monit", id: 1014850245
# mas "Motion", id: 434290957
mas "Newton", id: 1059655371
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Parcel", id: 639968404
mas "ToothFairy", id: 1191449274
# mas "WhatsApp", id: 1147396723
# mas "Xcode", id: 497799835

# declare -a cask_apps=(
# 	"appcleaner"
# 	"authy"
# 	"capture-one"
# 	"discord"
# )
# for app in "${cask_apps[@]}"; do
#   brew cask install "$app"
# done
