tap "epk/epk" # SF Mono Nerd Font
# tap "koekeishiya/formulae" # skhd
tap "nikitabobko/tap"


## CLI
# GitHub's own specific CLI
brew "gh"
# Distributed revision control system
brew "git"
# A better git diff, used in `~/.config/git/config`
brew "difftastic"
# Keep your Mac's application settings in sync
brew "stow"
# NeoVim, get on it
brew "neovim"


## Casks (GUI)
cask "aerospace"
cask "alacritty"
# cask "alfred"
cask "appcleaner"
cask "firefox"
cask "font-sf-mono-nerd-font"
cask "ghostty"
cask "kap"
cask "karabiner-elements"
cask "monarch"
cask "monitorcontrol"
cask "raycast"
# cask "rectangle-pro"
cask "roon"
cask "zed"
