tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Search tool like grep, but optimized for programmers
brew "ack"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Interpreted, interactive, object-oriented programming language
brew "python"

# Official Amazon AWS command-line interface
brew "awscli"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Distributed revision control system
brew "git"

# Add GitHub support to git on the command-line
brew "hub"

# Production Grade K8s Installation, Upgrades, and Management
brew "kops"

# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"

# Postgres C API library
brew "libpq"

# Keep your Mac's application settings in sync
brew "mackup"

# Mac App Store command-line interface
brew "mas"

# Open source relational database management system
brew "mysql-client@5.7"

# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"

# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"

# Text interface for Git repositories
brew "tig"

# Extraction utility for .zip compressed archives
brew "unzip"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Executes a program periodically, showing output fullscreen
brew "watch"

# Internet file retriever
brew "wget"

# Tracks most-used directories to make cd smarter
brew "z"

# UNIX shell (command interpreter)
brew "zsh"

# Drone CI cli
tap "drone/drone"
brew "drone/drone/drone"

# Validate your Kubernetes configurations
tap "garethr/kubeval"
brew "garethr/kubeval/kubeval"

# Tail logs from multiple Kubernetes pods at the same time
tap "johanhaleby/kubetail"
brew "johanhaleby/kubetail/kubetail"

# Decode all parts of a kubernetes secret, no more copypasting!
tap "mveritym/mel"
brew "mveritym/mel/kubedecode"

# The official CLI for Amazon EKS
tap "weaveworks/tap"
brew "weaveworks/tap/eksctl"

# cask "cyberduck"
cask "docker"
# cask "displaylink"
# cask "firefox"
cask "brave-browser"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-cloud-sdk"
# cask "google-drive-file-stream"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "iterm2"
# cask "lastpass"
# cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
